<?php

use Illuminate\Database\Seeder;
use \App\Music;

class MusicsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $sample_musics = [
            ["アルベニス","タンゴ"],
            ["エステン","人形の夢と目覚め"],
            ["エステン","アルプスの夕ばえ"],
            ["エルメンライヒ","紡ぎ歌"],
            ["ギロック","ソナチネ"],
            ["グリーグ","アリエッタ"],
            ["クレメンティ","ソナチネ 作品36-1"],
            ["クレメンティ","ソナチネ 作品36-3"],
            ["シューベルト","即興曲 Op.90-4"],
            ["シューマン","楽しき農夫"],
            ["シューマン","飛翔"],
            ["ショパン","マズルカ 作品7-1"],
            ["ショパン","ワルツ 作品64-2"],
            ["ショパン","小犬のワルツ"],
            ["ショパン","ワルツ19番"],
            ["ショパン","革命のエチュード"],
            ["ショパン","英雄ポロネーズ"],
            ["ショパン","幻想即興曲"],
            ["ショパン","別れの曲"],
            ["ジョプリン","ジ・エンターティナー"],
            ["ストリーボッグ","すみれ"],
            ["ドビュッシー","月の光"],
            ["ドビュッシー","二つのアラベスク"],
            ["ドビュッシー","雨の庭"],
            ["バダジェフスカ","乙女の祈り"],
            ["バッハ","メヌエット ト長調"],
            ["パッヘルベル","カノン"],
            ["ブラームス","二つのラプソディー"],
            ["ブルグミュラー","トルコ風のロンド"],
            ["ブルグミュラー","貴婦人の乗馬"],
            ["ブルグミュラー","アラベスク"],
            ["ベートーヴェン","6つのエコセーズ"],
            ["ベートーヴェン","エリーゼのために"],
            ["ヘルマン・ネッケ","クシコス・ポスト"],
            ["マクダウエル","野ばらに寄す"],
            ["メンデルスゾーン","春の歌"],
            ["メンデルスゾーン","ロンド・カプリチオーソ"],
            ["モーツァルト","ソナタ 第8番 第1楽章"],
            ["モーツァルト","ソナタ 第15番 第1楽章"],
            ["ランゲ","花の歌"],
            ["ランゲ","荒野のバラ"],
            ["リスト","ハンガリー狂詩曲2番"],
            ["リスト","ため息"],
            ["湯山 昭","バウムクーヘン"]
        ];

        foreach ($sample_musics as $value) {
            Music::create([
                'title' => $value[1],
                'composer' => $value[0],
                'limit' => mt_rand(1, 3)
            ]);
        }
    }
}
